XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-C_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>SAM-C_DFP</name>
  <description>Microchip SAM C Series Device Support and Examples</description>

  <releases>
    <release version="1.4.2" date="2020-10-21" deprecated="2020-10-21">
      This pack is going to be deprecated. Device Support is maintained by Microchip going forward.
      Updated MDK Examples have been moved to respective board support packs (BSP) from Keil.
      Please remove this pack and install one of the following packs:
      - Microchip.SAMC20_DFP.3.3.56.atpack
      - Microchip.SAMC21_DFP.3.4.78.atpack and Keil.SAMC21_BSP.1.0.0
    </release>
    <release version="1.4.1" date="2018-05-07">
      Updated vendor name from Atmel to Microchip.
    </release>
    <release version="1.4.0" date="2017-12-01">
      Added SAMC21N-XPRO board support.
    </release>
    <release version="1.3.0" date="2017-05-19">
      Added SAMC2xJ15A device support.
      Updated SAMC20, SAMC21 device support files.
    </release>
    <release version="1.2.0" date="2017-04-06">
      Added SAMC20N, SAMC21N basic device support.
      Updated SAMC20, SAMC21 device support files.
      Updated documentation.
    </release>
    <release version="1.1.0" date="2017-03-29">
      Updated SAMC20, SAMC21 device support files.
      Updated documentation.
    </release>
    <release version="1.0.0" date="2005-06-23">
      First Release version of SAM C Device Family Pack.
      - SAMC20 and SAMC21 basic device support.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Microchip</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Microchip</keyword>
    <keyword>SAM C</keyword>
  </keywords>

  <devices>
    <family Dfamily="SAM C Series" Dvendor="Microchip:3">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <!--book name="http://www.atmel.com/products/microcontrollers/arm/sam-c.aspx" title="SAMC Documents"/-->
      <description>
The Microchip | SMART SAM C ARM Cortex-M0+ based microcontroller (MCU) series builds on decades of innovation and experience in embedded Flash microcontroller technology.
It not only sets a new benchmark for flexibility and ease-of-use but also combines the performance and energy efficiency of an ARM Cortex-M0+ based MCU with an optimized architecture and peripheral set.
Microchip | SMART SAM C devices are truly differentiated 5V microcontrollers that are ideal for home appliances, industrial control and other 5V applications.
      </description>

      <!-- ******************************  SAM C20  ****************************** -->
      <subFamily DsubFamily="SAM C20">
        <processor Dclock="48000000"/>
        <book name="Documents/60001479A.pdf" title="SAM C20 Datasheet"/>
        <description>
A rich set of peripherals, flexibility and ease-of-use combined with 2.7V – 5.5V operating voltage make the Microchip SAM C20 ARM Cortex-M0+ based microcontroller series ideal for a wide range of consumer, industrial and other 5V applications.
SAM C20 devices are designed for simple and intuitive migration between SAM C devices with identical peripheral modules, hex compatible code and a linear address map.
        </description>

        <feature type="CoreOther"     n="6"                       name="Event System channels"/>
        <feature type="DMA"           n="6"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="Timer"         n="3"       m="32"          name="Timer/Counter for Control"/>
        <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
        <feature type="DAC"           n="1"       m="10"/>
        <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
        <feature type="AnalogOther"   n="2"                       name="Analog Comparator"/>
        <feature type="RTC"           n="32768"/>
        <feature type="Touch"         n="1"                       name="Peripheral Touch Controller"/>
        <feature type="VCC"           n="2.70"    m="5.50"/>
        <feature type="Temp"          n="-40"     m="105"/>

        <!-- ******************************  ATSAMC20E15A  ****************************** -->
        <device Dname="ATSAMC20E15A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20E15A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20E15A.svd"/>
          <memory     id="IROM1"                        start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory     id="IRAM1"                        start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash/ATSAMC_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20E16A  ****************************** -->
        <device Dname="ATSAMC20E16A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20E16A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20E16A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash/ATSAMC_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

