XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-C_DFP.pdsc
        <!-- ******************************  ATSAMC20J17A  ****************************** -->
        <device Dname="ATSAMC20J17A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20J17A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20J17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="52"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20J17AU  ****************************** -->
        <device Dname="ATSAMC20J17AU">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20J17AU__"/>
          <debug svd="SVD/SAMC20/ATSAMC20J17AU.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" default="1" startup="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20J18A  ****************************** -->
        <device Dname="ATSAMC20J18A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20J18A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20J18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="52"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20J18AU  ****************************** -->
        <device Dname="ATSAMC20J18AU">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20J18AU__"/>
          <debug svd="SVD/SAMC20/ATSAMC20J18AU.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" default="1" startup="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20N17A  ****************************** -->
        <device Dname="ATSAMC20N17A">
          <compile header="Device/SAMC20N/Include/samc20.h" define="__SAMC20N17A__"/>
          <debug svd="SVD/SAMC20N/ATSAMC20N17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20N18A  ****************************** -->
        <device Dname="ATSAMC20N18A">
          <compile header="Device/SAMC20N/Include/samc20.h" define="__SAMC20N18A__"/>
          <debug svd="SVD/SAMC20N/ATSAMC20N18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>
      </subFamily>

      <!-- ******************************  SAM C21  ****************************** -->
      <subFamily DsubFamily="SAM C21">
        <processor Dclock="48000000"/>
        <book name="Documents/60001479A.pdf" title="SAM C21 Datasheet"/>
        <description>
A rich set of peripherals, flexibility and ease-of-use combined with 2.7V – 5.5V operating voltage make the Microchip SAM C21 ARM Cortex-M0+ based microcontroller series ideal for a wide range of consumer and industrial applications.
SAM C21 devices are designed for simple and intuitive migration between SAM C devices with identical peripheral modules, compatible code and a linear address map.
        </description>

        <feature type="CoreOther"     n="12"                      name="Event System channels"/>
        <feature type="DMA"           n="12"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="Timer"         n="3"       m="32"          name="Timer/Counter for Control"/>
        <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
        <feature type="CAN"           n="2"/>
        <feature type="DAC"           n="1"       m="10"/>
        <feature type="RTC"           n="32768"/>
        <feature type="TempSens"      n="1"/>
        <feature type="Touch"         n="1"                       name="Peripheral Touch Controller"/>
        <feature type="VCC"           n="2.70"    m="5.50"/>
        <feature type="Temp"          n="-40"     m="105"/>

