XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-C_DFP.pdsc
        <!-- ******************************  ATSAMC21E15A  ****************************** -->
        <device Dname="ATSAMC21E15A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21E15A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21E15A.svd"/>
          <memory     id="IROM1"                        start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory     id="IRAM1"                        start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash/ATSAMC_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="ADC"           n="1"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="3"                       name="Analog Comparator"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21E16A  ****************************** -->
        <device Dname="ATSAMC21E16A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21E16A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21E16A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash/ATSAMC_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="ADC"           n="1"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="3"                       name="Analog Comparator"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21E17A  ****************************** -->
        <device Dname="ATSAMC21E17A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21E17A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21E17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="ADC"           n="1"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="3"                       name="Analog Comparator"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21E18A  ****************************** -->
        <device Dname="ATSAMC21E18A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21E18A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21E18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="ADC"           n="1"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="3"                       name="Analog Comparator"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21G15A  ****************************** -->
        <device Dname="ATSAMC21G15A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21G15A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21G15A.svd"/>
          <memory     id="IROM1"                        start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory     id="IRAM1"                        start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash/ATSAMC_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="ADC"           n="2"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

