XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-C_DFP.pdsc
  <boards>
    <board vendor="Atmel" name="SAMC21N-XPRO" revision="Rev.5" salesContact="http://www.atmel.com/buy/contact_us.aspx?contactType=Sales%20Representative" orderForm="http://store.atmel.com/product.ashx?sku=ATSAMD20-XPRO&amp;tool_id=">
      <description>Microchip SAM C21N Xplained Pro Evaluation Kit</description>
      <image small="Boards/Atmel/SAMC21N-XPRO/Documents/SAMC21N-XPRO_small.jpg"
             large="Boards/Atmel/SAMC21N-XPRO/Documents/SAMC21N-XPRO_large.jpg"/>
      <book category="overview"  name="http://www.microchip.com/DevelopmentTools/ProductDetails.aspx?PartNO=ATSAMC21N-XPRO" title="SAMC21N Xplained Pro Evaluation Kit"/>
      <book category="manual"    name="Boards/Atmel/SAMC21N-XPRO/Documents/70005318A.pdf" title="User Guide"/>
      <book category="schematic" name="Boards/Atmel/SAMC21N-XPRO/Documents/SAMC21N_Xplained_Pro_design_documentation.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAMC21N18A"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" Dfamily="SAM C21"/>
	    <feature type="ODbg"      n="1"              name="Embedded Debugger USB"/>
		<feature type="XTAL"      n="32768"/>
	    <feature type="PWR"       n="5"              name="USB Powered (from the Debugger)"/>
	    <feature type="PWR"       n="5"              name="External Power"/>
	    <feature type="DIO"       n="3"              name="Xplained Pro Extension headers"/>
	    <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
	    <feature type="Button"    n="1"              name="QTouch button"/>
	    <feature type="LED"       n="1"              name="Yellow User LED"/>
	    <feature type="USB"       n="1"              name="Target USB"/>
	    <feature type="CustomFF"  n="60" m="100"/>
      <debugInterface adapter="Embedded Debugger" connector="Micro-USB"/>
    </board>
  </boards>

  <examples>
    <!-- SAMC21N-XPRO Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="Boards/Atmel/SAMC21N-XPRO/Blinky">
      <description>CMSIS-RTOS2 based Blinky example</description>
      <board name="SAMC21N-XPRO" vendor="Atmel"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>


</package>
